In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [7]:
s.index.name = '네임'

In [5]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [9]:
s

네임
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [10]:
s = s/1000

In [15]:
s['서울']

9904.312

In [16]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [21]:
s1 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158}, index =["서울","인천","부산","대전"])
s1

서울    9631482
인천    2632035
부산    3393191
대전    1490158
dtype: int64

In [22]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035}, index =["서울","인천","부산"])
s2

서울    9631482
인천    2632035
부산    3393191
dtype: int64

In [23]:
s = s2 - s1

In [25]:
s.notnull()

대전    False
부산     True
서울     True
인천     True
dtype: bool

In [28]:
s[s.notnull()]

부산    0.0
서울    0.0
인천    0.0
dtype: float64

In [29]:
s["경기"] = 1213243

In [31]:
s

대전          NaN
부산          0.0
서울          0.0
인천          0.0
경기    1213243.0
dtype: float64

In [63]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"] # 순서 지정
index = ["서울", "부산", "인천", "대구"] # 순서 지정
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [25]:
df.loc['경기'] = ['수도권',12123,141341,14354,12414,0.23]

In [35]:
df.loc[df.shape[0]] = ['수도권',12121,12341231,1241241,1414,0.3]

In [65]:
df.loc[:,"지역"].count()

4

In [45]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [48]:
df["증가폭"] = np.where(df["2010-2015 증가율"]>=2,"큼","작음")

In [23]:
df

,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
0,\t\t108,서울,1907-10-01,13.9,20.2,25.4,1907-10-05,8.3,3.3,1907-10-24
1,\t\t108,서울,1907-11-01,5.3,10.2,21.3,1907-11-01,0.6,-8.9,1907-11-30
2,\t\t108,서울,1907-12-01,-3.9,0.8,9.0,1907-12-13,-8.7,-20.1,1907-12-23
3,\t\t108,서울,1908-01-01,-3.5,0.1,6.2,1908-01-31,-7.5,-14.3,1908-01-22
4,\t\t108,서울,1908-02-01,-4.0,0.8,8.4,1908-02-27,-8.8,-15.8,1908-02-07
...,...,...,...,...,...,...,...,...,...,...
1348,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1349,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1350,\t\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1351,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1352,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [60]:
df['지역'][1:3]

AttributeError: 'Series' object has no attribute 'column'

In [61]:
df[ ["2010", "2015"] ]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [67]:
type(df[ "2010" ])

pandas.core.series.Series

In [68]:
df[["2010"]]
type(df[["2010"]])

pandas.core.frame.DataFrame

In [71]:
df[["2010"]][1:3]

       2010
부산  3393191
인천  2632035

In [22]:
#행 추가는 어떻게 해야??
df.columns

{'지역':"경기", '2015':12121, '2010':12398434, '2005':1284324, '2000':1202434, '2010-2015 증가율':21.4, '증가폭':}

SyntaxError: ':' expected after dictionary key (1249874958.py, line 4)

In [78]:
df.loc['경기'] = [142124,1432123541,12412421,141424,124124,21.3,"큼"]

In [79]:
df

        지역        2015      2010     2005     2000  2010-2015 증가율 증가폭
서울     수도권     9904312   9631482  9762546  9853972           2.83   큼
부산     경상권     3448737   3393191  3512547  3655437           1.63  작음
인천     수도권     2890451   2632035  2517680  2466338           9.82   큼
대구     경상권     2466052   2431774  2456016  2473990           1.41  작음
경기  142124  1432123541  12412421   141424   124124          21.30   큼

In [187]:
pd.read_csv("C:\workspace\python\WASSUP\data/기상온도_서울202012.csv")

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xc1 in position 3: invalid start byte

In [66]:
df = pd.read_csv("C:\workspace\python\WASSUP\data/기상온도_서울202012.csv", encoding="cp949")

In [12]:
df.to_e("file이름.csv")

In [14]:
pd.read_csv("C:\workspace\python\WASSUP\\file이름.csv")

,Unnamed: 0,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
0,0,\t\t108,서울,1907-10-01,13.9,20.2,25.4,1907-10-05,8.3,3.3,1907-10-24
1,1,\t\t108,서울,1907-11-01,5.3,10.2,21.3,1907-11-01,0.6,-8.9,1907-11-30
2,2,\t\t108,서울,1907-12-01,-3.9,0.8,9.0,1907-12-13,-8.7,-20.1,1907-12-23
3,3,\t\t108,서울,1908-01-01,-3.5,0.1,6.2,1908-01-31,-7.5,-14.3,1908-01-22
4,4,\t\t108,서울,1908-02-01,-4.0,0.8,8.4,1908-02-27,-8.8,-15.8,1908-02-07
...,...,...,...,...,...,...,...,...,...,...,...
1348,1348,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1349,1349,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1350,1350,\t\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1351,1351,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1352,1352,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
df.loc[3,"일시"]

'1908-01-01'

In [42]:
df.iloc[df.shape[0]-1,df.shape[1]-1]

,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
0,\t\t108,서울,1907-10-01,13.9,20.2,25.4,1907-10-05,8.3,3.3,1907-10-24
1,\t\t108,서울,1907-11-01,5.3,10.2,21.3,1907-11-01,0.6,-8.9,1907-11-30
2,\t\t108,서울,1907-12-01,-3.9,0.8,9.0,1907-12-13,-8.7,-20.1,1907-12-23
3,\t\t108,서울,1908-01-01,-3.5,0.1,6.2,1908-01-31,-7.5,-14.3,1908-01-22
4,\t\t108,서울,1908-02-01,-4.0,0.8,8.4,1908-02-27,-8.8,-15.8,1908-02-07
...,...,...,...,...,...,...,...,...,...,...
1348,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1349,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1350,\t\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1351,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1352,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [62]:
df.loc[0].count()

10

In [67]:
df.value_counts()

\t\t지점번호  지점명  일시          평균기온(℃)  평균최고기온(℃)  최고기온(℃)  \t최고기온일자    평균최저기온(℃)  최저기온(℃)  최저기온일자
\t\t108   서울   1907-10-01   13.9    20.2       25.4     1907-10-05   8.3        3.3     1907-10-24    1
               1984-11-01   8.1     12.9       21.2     1984-11-06   4.1       -5.7     1984-11-28    1
               1984-09-01   20.1    25.0       28.7     1984-09-07   16.3       10.1    1984-09-26    1
               1984-08-01   26.3    30.5       35.2     1984-08-10   23.3       18.9    1984-08-17    1
               1984-07-01   25.2    29.5       34.7     1984-07-31   22.0       19.2    1984-07-17    1
                                                                                                     ..
               1944-05-01   15.9    22.4       29.3     1944-05-29   10.8       4.6     1944-05-06    1
               1944-04-01   9.6     16.1       23.4     1944-04-30   4.1       -0.9     1944-04-04    1
               1944-03-01   3.2     8.9        18.2     1944-03-27  -1.8       -6.6     1944-03-07    1
               1944-02-01  -2.4     2.7        9.7      1944-02-29  -8.0       -13.4    1944-02-08    1
               2020-12-01  -0.2     4.0        9.4      2020-12-11  -4.1       -11.2    2020-12-16    1
Name: count, Length: 1320, dtype: int64

In [188]:
#np.random.seed(10000000)
s2 = pd.Series(np.random.randint(10, size=100))
s2.head(3)

0    3
1    1
2    0
dtype: int32

In [124]:
s2.value_counts().sort_values(ascending=True) #시리즈에서는

1    14
5    15
4    15
3    16
0    18
2    22
Name: count, dtype: int64

In [132]:
s2.sum()

241

In [131]:
df.sort_values(by=["평균기온(℃)","최고기온(℃)"],ascending=False)

,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
1316,\t\t108,서울,2018-08-01,28.8,33.3,39.6,2018-08-01,25.2,20.2,2018-08-27
1027,\t\t108,서울,1994-07-01,28.5,32.6,38.4,1994-07-24,25.3,21.3,1994-07-02
1292,\t\t108,서울,2016-08-01,28.0,32.6,36.6,2016-08-21,24.5,16.1,2016-08-31
1315,\t\t108,서울,2018-07-01,27.8,32.1,38.3,2018-07-31,24.2,17.7,2018-07-08
430,\t\t108,서울,1943-08-01,27.8,34.6,38.2,1943-08-24,23.1,15.4,1943-08-31
...,...,...,...,...,...,...,...,...,...,...
1348,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1349,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1350,\t\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1351,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1352,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [141]:
df[["평균기온(℃)","평균최고기온(℃)","최고기온(℃)"]].sum(axis=0)

평균기온(℃)      15425.0
평균최고기온(℃)    22032.9
최고기온(℃)      30864.2
dtype: float64

,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
0,\t\t108,서울,1907-10-01,13.9,20.2,25.4,1907-10-05,8.3,3.3,1907-10-24
1,\t\t108,서울,1907-11-01,5.3,10.2,21.3,1907-11-01,0.6,-8.9,1907-11-30
2,\t\t108,서울,1907-12-01,-3.9,0.8,9.0,1907-12-13,-8.7,-20.1,1907-12-23
3,\t\t108,서울,1908-01-01,-3.5,0.1,6.2,1908-01-31,-7.5,-14.3,1908-01-22
4,\t\t108,서울,1908-02-01,-4.0,0.8,8.4,1908-02-27,-8.8,-15.8,1908-02-07
5,\t\t108,서울,1908-03-01,2.9,8.1,18.2,1908-03-29,-1.7,-7.4,1908-03-02
6,\t\t108,서울,1908-04-01,10.1,16.5,22.9,1908-04-20,4.6,-0.7,1908-04-07
7,\t\t108,서울,1908-05-01,14.9,21.1,25.2,1908-05-25,10.0,5.2,1908-05-04
8,\t\t108,서울,1908-06-01,20.7,26.8,32.4,1908-06-23,16.3,11.6,1908-06-08
9,\t\t108,서울,1908-07-01,23.5,27.6,32.9,1908-07-24,20.3,14.7,1908-07-06

In [146]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [152]:
df3.apply(lambda x: print(x),axis=1)

A    1
B    2
C    1
Name: 0, dtype: int64
A    3
B    3
C    5
Name: 1, dtype: int64
A    4
B    1
C    2
Name: 2, dtype: int64
A    3
B    2
C    4
Name: 3, dtype: int64
A    4
B    3
C    4
Name: 4, dtype: int64

0    None
1    None
2    None
3    None
4    None
dtype: object

In [2]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [3]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [4]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q1', 'Q2', 'Q4', 'Q3', 'Q1', ..., 'Q1', 'Q2', 'Q3', 'Q4', 'Q1']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [5]:
np.round(np.random.rand(3, 5), 2)

array([[0.85, 0.89, 0.84, 0.86, 0.12],
       [0.65, 0.21, 0.09, 0.61, 0.24],
       [0.71, 0.39, 0.74, 0.54, 0.15]])

In [6]:
np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)])

array([['A', 'B', 'C', 'D', 'E'],
       ['0.45', '0.22', '0.74', '0.78', '0.99'],
       ['0.62', '0.82', '0.29', '0.42', '0.02'],
       ['0.13', '0.52', '0.37', '0.85', '0.5']], dtype='<U32')

In [7]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)]).T, # transpose
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [8]:
df2 = df1.set_index("C1")
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [9]:
df2.set_index("C2")

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [10]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [3]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [4]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [8]:
df3[ ("B", "C2") ]

0    2.24
1   -0.15
2    1.45
3    0.33
4   -0.85
Name: (B, C2), dtype: float64

In [9]:
df4.loc[("All", "All"), :] = df4.sum()
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [17]:
np.random.seed(0)                            
class1 = np.array(list('AAAAABBBBB')).reshape(10, 1)
number = np.hstack([np.random.choice(range(1,6), 5, replace=False), np.random.choice(range(1,6), 5, replace=False)]).reshape(10,1)
score = np.random.randint(0,101,(10,3))
df_score3 = pd.DataFrame(np.hstack([class1,number, score]), columns=["반","번호","국어","영어","수학"])
df_score3

   반 번호  국어  영어  수학
0  A  3  21  36  87
1  A  1  70  88  88
2  A  2  12  58  65
3  A  4  39  87  46
4  A  5  88  81  37
5  B  1  25  77  72
6  B  3   9  20  80
7  B  2  69  79  47
8  B  5  64  82  99
9  B  4  88  49  29

In [18]:
df_score4 = df_score3.set_index(['반', '번호'])
df_score4

      국어  영어  수학
반 번호
A 3   21  36  87
  1   70  88  88
  2   12  58  65
  4   39  87  46
  5   88  81  37
B 1   25  77  72
  3    9  20  80
  2   69  79  47
  5   64  82  99
  4   88  49  29

In [19]:
df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
df1
df2 = pd.DataFrame(np.arange(12).reshape((6, 2)),
    index=[['부산', '부산', '서울', '서울', '서울', '서울'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1', '데이터2'])
df2
pd.merge(df1, df2, left_on=['도시', '연도'], right_index=True)

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [20]:
import seaborn as sns
iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [21]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [22]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()

iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [23]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [24]:
df3.columns.names = ["Cidx1", "Cidx2"]
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [25]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [60]:
#1-1 이랑 1-2반 인원을 데이터 프레임에 넣어서 구분해보기.
#각반의 인원에게는 고유한 학생 번호가 부여됨 
# 열은 이름 국어, 영어, 수학 점수가 추가됨
np.random.seed(0)
first = pd.DataFrame(["권은경","나혜미","백예숙","백지영","이상아","김다혜","마준영","문예성","박슬기","이준민"])
score = np.random.randint(1, 101, (10, 3))

data = np.hstack((first,score))

df = pd.DataFrame(data,columns=[["개인정보","과목","과목","과목"],["이름", "국어", "영어", "수학"]],index=[["1-1","1-1","1-1","1-1","1-1","1-2","1-2","1-2","1-2","1-2"],[1,2,3,4,5,1,2,3,4,5]])
df.columns.names = ["대분류","소분류"]
df.index.names = ["반","번호"]
df

대분류    개인정보  과목
소분류      이름  국어  영어  수학
반   번호
1-1 1   권은경  45  48  65
    2   나혜미  68  68  10
    3   백예숙  84  22  37
    4   백지영  88  71  89
    5   이상아  89  13  59
1-2 1   김다혜  66  40  88
    2   마준영  47  89  82
    3   문예성  38  26  78
    4   박슬기  73  10  21
    5   이준민  81  70  80

In [186]:
data = {
    "이름":["권은경","나혜미","백예숙","백지영","이상아","김다혜","마준영","문예성","박슬기","이준민"],
    "영어":np.random.randint(1, 101,10),
    "국어":[12,14,16,74,85,58,59,83,76,25],
    "수학":np.random.randint(1, 101,10)
}
columns = ["이름","국어","영어","수학"]
df = pd.DataFrame(data, columns=columns)

df.index.name = "번호"
df["과학"] = np.random.randint(1, 101,10)
df.loc[10] = ["피승권",12,31,14,53]
df.loc[11] = ["문석민",100,100,100,np.nan]

df

df[['수학']].apply(lambda x: x/2 ,axis=0)

      수학
번호
0   12.0
1    8.5
2   10.0
3   24.0
4   24.5
5   17.0
6   33.5
7    7.5
8    1.0
9   11.5
10   7.0
11  50.0

In [91]:
df.to_csv("수강생점수.csv")

In [98]:
pd.read_csv("./data\\전국 평균 분양가격.csv", encoding = "cp949")

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581
2,대구,8080,8080,8077,8101,8267,8274,8360,8360,8370,...,8439,8253,8327,8416,8441,8446,8568,8542,8542,8795
3,인천,10204,10204,10408,10408,10000,9844,10058,9974,9973,...,10020,10020,10017,9876,9876,9938,10551,10443,10443,10449
4,광주,6098,7326,7611,7346,7346,7523,7659,7612,7622,...,7752,7748,7752,7756,7861,7914,7877,7881,8089,8231
5,대전,8321,8321,8321,8341,8341,8341,8333,8333,8333,...,8067,8067,8067,8067,8067,8145,8272,8079,8079,8079
6,울산,8090,8090,8090,8153,8153,8153,8153,8153,8493,...,8891,8891,8526,8526,8629,9380,9192,9190,9190,9215
7,경기,10855,10855,10791,10784,10876,10646,10266,10124,10134,...,10356,10379,10391,10355,10469,10684,10685,10573,10518,10573
8,세종,7601,7600,7532,7814,7908,7934,8067,8067,8141,...,8592,8560,8560,8560,8555,8546,8546,8671,8669,8695
9,강원,6230,6230,6230,6141,6373,6350,6350,6268,6268,...,6365,6365,6348,6350,6182,6924,6846,6986,7019,7008
10,충북,6589,6589,6611,6625,6678,6598,6587,6586,6586,...,6724,6743,6749,6747,6783,6790,6805,6682,6601,6603
11,충남,6365,6365,6379,6287,6552,6591,6644,6805,6914,...,6940,6989,6976,6980,7161,7017,6975,6939,6935,6942
12,전북,6282,6281,5946,5966,6277,6306,6351,6319,6436,...,6583,6583,6583,6583,6542,6551,6556,6601,6750,6580
13,전남,5678,5678,5678,5696,5736,5656,5609,5780,5685,...,5768,5784,5784,5833,5825,5940,6050,6243,6286,6289
14,경북,6168,6168,6234,6317,6412,6409,6554,6556,6563,...,6881,6989,6992,6953,6997,7006,6966,6887,7035,7037
15,경남,6473,6485,6502,6610,6599,6610,6615,6613,6606,...,7125,7332,7592,7588,7668,7683,7717,7715,7723,7665
16,제주,7674,7900,7900,7900,7900,7900,7914,7914,7914,...,7724,7739,7739,7739,7826,7285,7285,7343,7343,7343

In [147]:
np.random.seed(1000000)
df = pd.DataFrame(np.random.randint(10, size=(10, 1)))
df

   0
0  2
1  6
2  8
3  2
4  4
5  5
6  6
7  3
8  2
9  4

In [152]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [169]:
df3.apply(lambda x: , axis=0) #기본값 0

NameError: name 'x' is not defined

In [195]:
ages = [1,2,3,4,5,6,2,3,2,1,3,4,4,5,100]

In [190]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', '중년']
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [200]:
pd.value_counts(pd.qcut(ages, 4, labels=[ "Q1", "Q2", "Q3","Q4"]))

Q1    5
Q4    4
Q2    3
Q3    3
Name: count, dtype: int64

In [3]:
data ={'2023년11월19일':[10,20,30],
       '2023년11월20일':[40,50,60],
       '2023년11월21일':[70,80,90],
       '2023년11월22일':[100,120,130]}
df = pd.DataFrame(data)
df

   2023년11월19일  2023년11월20일  2023년11월21일  2023년11월22일
0           10           40           70          100
1           20           50           80          120
2           30           60           90          130

In [4]:
pd.date_range("2023-11-1", "2023-11-30")

DatetimeIndex(['2023-11-01', '2023-11-02', '2023-11-03', '2023-11-04',
               '2023-11-05', '2023-11-06', '2023-11-07', '2023-11-08',
               '2023-11-09', '2023-11-10', '2023-11-11', '2023-11-12',
               '2023-11-13', '2023-11-14', '2023-11-15', '2023-11-16',
               '2023-11-17', '2023-11-18', '2023-11-19', '2023-11-20',
               '2023-11-21', '2023-11-22', '2023-11-23', '2023-11-24',
               '2023-11-25', '2023-11-26', '2023-11-27', '2023-11-28',
               '2023-11-29', '2023-11-30'],
              dtype='datetime64[ns]', freq='D')

In [5]:
pd.date_range("2023-11-1", "2023-11-30", freq="B")

DatetimeIndex(['2023-11-01', '2023-11-02', '2023-11-03', '2023-11-06',
               '2023-11-07', '2023-11-08', '2023-11-09', '2023-11-10',
               '2023-11-13', '2023-11-14', '2023-11-15', '2023-11-16',
               '2023-11-17', '2023-11-20', '2023-11-21', '2023-11-22',
               '2023-11-23', '2023-11-24', '2023-11-27', '2023-11-28',
               '2023-11-29', '2023-11-30'],
              dtype='datetime64[ns]', freq='B')

In [6]:
np.random.seed(0)
ts = pd.Series(np.random.randn(4), index=pd.date_range(
    "2018-1-1", periods=4, freq="M"))
ts

2018-01-31    1.764052
2018-02-28    0.400157
2018-03-31    0.978738
2018-04-30    2.240893
Freq: M, dtype: float64

In [7]:
ts.shift(1)

2018-01-31         NaN
2018-02-28    1.764052
2018-03-31    0.400157
2018-04-30    0.978738
Freq: M, dtype: float64

In [8]:
ts.shift(1, freq="M")

2018-02-28    1.764052
2018-03-31    0.400157
2018-04-30    0.978738
2018-05-31    2.240893
Freq: M, dtype: float64

In [9]:
ts = pd.Series(np.random.randn(60), index=pd.date_range(
    "2018-1-1", periods=60, freq="T"))
ts.head(20)

2018-01-01 00:00:00    1.867558
2018-01-01 00:01:00   -0.977278
2018-01-01 00:02:00    0.950088
2018-01-01 00:03:00   -0.151357
2018-01-01 00:04:00   -0.103219
2018-01-01 00:05:00    0.410599
2018-01-01 00:06:00    0.144044
2018-01-01 00:07:00    1.454274
2018-01-01 00:08:00    0.761038
2018-01-01 00:09:00    0.121675
2018-01-01 00:10:00    0.443863
2018-01-01 00:11:00    0.333674
2018-01-01 00:12:00    1.494079
2018-01-01 00:13:00   -0.205158
2018-01-01 00:14:00    0.313068
2018-01-01 00:15:00   -0.854096
2018-01-01 00:16:00   -2.552990
2018-01-01 00:17:00    0.653619
2018-01-01 00:18:00    0.864436
2018-01-01 00:19:00   -0.742165
Freq: T, dtype: float64

In [10]:
!pip install pandas_datareader
!pip install yfinance

Collecting pandas_datareader
  Downloading pandas_datareader-0.10.0-py3-none-any.whl (109 kB)
     ---------------------------------------- 0.0/109.5 kB ? eta -:--:--
     --- ------------------------------------ 10.2/109.5 kB ? eta -:--:--
     ------ ------------------------------ 20.5/109.5 kB 222.6 kB/s eta 0:00:01
     ------------- ----------------------- 41.0/109.5 kB 330.3 kB/s eta 0:00:01
     --------------------------------- -- 102.4/109.5 kB 658.3 kB/s eta 0:00:01
     ------------------------------------ 109.5/109.5 kB 636.0 kB/s eta 0:00:00
Requirement already satisfied: lxml in c:\users\pee\anaconda3\lib\site-packages (from pandas_datareader) (4.9.3)
Requirement already satisfied: pandas>=0.23 in c:\users\pee\anaconda3\lib\site-packages (from pandas_datareader) (2.0.3)
Requirement already satisfied: requests>=2.19.0 in c:\users\pee\anaconda3\lib\site-packages (from pandas_datareader) (2.31.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pee\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\pee\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\pee\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\pee\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (1.24.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\pee\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\pee\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\pee\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\pee\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (2023.7.22)
Requirement already satisfied: six>=1.5 in c:\users\pee\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas>=0.23->pandas_datareader) (1.16.0)
Installing collected packages: pandas_datareader
Successfully installed pandas_datareader-0.10.0
Collecting yfinance
  Obtaining dependency information for yfinance from https://files.pythonhosted.org/packages/09/82/5a5eee685095a6c1f8968db75bba8536baa8046c970be25e1ac91a843839/yfinance-0.2.33-py2.py3-none-any.whl.metadata
  Downloading yfinance-0.2.33-py2.py3-none-any.whl.metadata (11 kB)
Requirement already satisfied: pandas>=1.3.0 in c:\users\pee\anaconda3\lib\site-packages (from yfinance) (2.0.3)
Requirement already satisfied: numpy>=1.16.5 in c:\users\pee\anaconda3\lib\site-packages (from yfinance) (1.24.3)
Requirement already satisfied: requests>=2.31 in c:\users\pee\anaconda3\lib\site-packages (from yfinance) (2.31.0)
Collecting multitasking>=0.0.7 (from yfinance)
  Downloading multitasking-0.0.11-py3-none-any.whl (8.5 kB)
Requirement already satisfied: lxml>=4.9.1 in c:\users\pee\anaconda3\lib\site-packages (from yfinance) (4.9.3)
Requirement already satisfied: appdirs>=1.4.4 in c:\users\pee\anaconda3\lib\site-packages (from yfinance) (1.4.4)
Requirement already satisfied: pytz>=2022.5 in c:\users\pee\anaconda3\lib\site-packages (from yfinance) (2023.3.post1)
Collecting frozendict>=2.3.4 (from yfinance)
  Obtaining dependency information for frozendict>=2.3.4 from https://files.pythonhosted.org/packages/b6/2c/e391d6d57bbd837d383a6b69b54ecb4768d75b31d8bc7a380b4b4afe4cb2/frozendict-2.3.10-py3-none-any.whl.metadata
  Downloading frozendict-2.3.10-py3-none-any.whl.metadata (20 kB)
Collecting peewee>=3.16.2 (from yfinance)
  Downloading peewee-3.17.0.tar.gz (2.9 MB)
     ---------------------------------------- 0.0/2.9 MB ? eta -:--:--
      --------------------------------------- 0.1/2.9 MB 3.4 MB/s eta 0:00:01
     ----- ---------------------------------- 0.4/2.9 MB 6.3 MB/s eta 0:00:01
     ---------- ----------------------------- 0.7/2.9 MB 6.8 MB/s eta 0:00:01
     ------------------- -------------------- 1.5/2.9 MB 9.3 MB/s eta 0:00:01
     --------------------------------- ------ 2.5/2.9 MB 12.2 MB/s eta 0:00:01
     ---------------------------------------- 2.9/2.9 MB 12.6 MB/s eta 0:00:00
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Requirement already satisfied: beautifulsoup4>=4.11.1 in c:\users\pee\anaconda3\lib\site-packages (from yfinance) (4.12.2)
Collecting html5lib>=1.1 (from yfinance)
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     ---------------------------------------- 0.0/112.2 kB ? eta -:--:--
     -------------------------------------- 112.2/112.2 kB 6.4 MB/s eta 0:00:00
Requirement already satisfied: soupsieve>1.2 in c:\users\pee\anaconda3\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.4)
Requirement already satisfied: six>=1.9 in c:\users\pee\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in c:\users\pee\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pee\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2.8.2)
Requirement already satisfied: tzdata>=2022.1 in c:\users\pee\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\pee\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\pee\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\pee\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\pee\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2023.7.22)
Downloading yfinance-0.2.33-py2.py3-none-any.whl (69 kB)
   ---------------------------------------- 0.0/69.0 kB ? eta -:--:--
   ---------------------------------------- 69.0/69.0 kB ? eta 0:00:00
Downloading frozendict-2.3.10-py3-none-any.whl (14 kB)
Building wheels for collected packages: peewee
  Building wheel for peewee (pyproject.toml): started
  Building wheel for peewee (pyproject.toml): finished with status 'done'
  Created wheel for peewee: filename=peewee-3.17.0-py3-none-any.whl size=135766 sha256=cb03007df945708a0a1fd48e263a568b81297b0a2b7751166f69bdac7e654df8
  Stored in directory: c:\users\pee\appdata\local\pip\cache\wheels\02\20\23\74a10d0cd31f5d41c19b92ddf4c138ceff01b9f4675f19dbf5
Successfully built peewee
Installing collected packages: peewee, multitasking, html5lib, frozendict, yfinance
Successfully installed frozendict-2.3.10 html5lib-1.1 multitasking-0.0.11 peewee-3.17.0 yfinance-0.2.33

In [11]:
import matplotlib.pyplot as plt
plt.style.use("ggplot")

# 한글 및 특정 문자 깨짐 문제 해결
import koreanize_matplotlib # 시본의 한글 깨짐은 해결못하지만, - 깨짐 해결
from matplotlib import font_manager, rc # 폰트 세팅을 위한 모듈 추가
font_path = "C:/Windows/Fonts/malgun.ttf" # 사용할 폰트명 경로 삽입
font = font_manager.FontProperties(fname = font_path).get_name()
rc('font', family = font)

ModuleNotFoundError: No module named 'koreanize_matplotlib'